def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (int): сторона прямоугольника
            b (int): сторона прямоугольника

        Возвращаемое значение:
            a * b: площадь прямоугольника со сторонами a и b.
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (int):
            b (int):

        Возвращаемое значение:
            (a + b)*2: периметр треугольника со сторонами a и b.
    '''
    return (a + b)*2