def area(a, h):
    '''
    Возвращает площадь треугольника.

        Параметры:
            a (int): сторона треугольника
            h (int): высота треугольника

        Возвращаемое значение:
            a * h / 2: площадь треугольника со стороной a и высотой h.
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

        Параметры:
            a (int): сторона треугольника
            b (int): сторона треугольника
            c (int): сторона треугольника

        Возвращаемое значение:
            a + b + c: периметр треугольника со стороной a и высотой h.
    '''
    return a + b + c